<?php
/**
 *
 * SugarCRM Community Edition is a customer relationship management program developed by
 * SugarCRM, Inc. Copyright (C) 2004-2013 SugarCRM Inc.
 *
 * SuiteCRM is an extension to SugarCRM Community Edition developed by SuiteCRM Ltd.
 * Copyright (C) 2011 - 2025 SuiteCRM Ltd.
 *
 * This program is free software; you can redistribute it and/or modify it under
 * the terms of the GNU Affero General Public License version 3 as published by the
 * Free Software Foundation with the addition of the following permission added
 * to Section 15 as permitted in Section 7(a): FOR ANY PART OF THE COVERED WORK
 * IN WHICH THE COPYRIGHT IS OWNED BY SUGARCRM, SUGARCRM DISCLAIMS THE WARRANTY
 * OF NON INFRINGEMENT OF THIRD PARTY RIGHTS.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
 * FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more
 * details.
 *
 * You should have received a copy of the GNU Affero General Public License along with
 * this program; if not, see http://www.gnu.org/licenses or write to the Free
 * Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301 USA.
 *
 * You can contact SugarCRM, Inc. headquarters at 10050 North Wolfe Road,
 * SW2-130, Cupertino, CA 95014, USA. or at email address contact@sugarcrm.com.
 *
 * The interactive user interfaces in modified source and object code versions
 * of this program must display Appropriate Legal Notices, as required under
 * Section 5 of the GNU Affero General Public License version 3.
 *
 * In accordance with Section 7(b) of the GNU Affero General Public License version 3,
 * these Appropriate Legal Notices must retain the display of the "Powered by
 * SugarCRM" logo and "Supercharged by SuiteCRM" logo. If the display of the logos is not
 * reasonably feasible for technical reasons, the Appropriate Legal Notices must
 * display the words "Powered by SugarCRM" and "Supercharged by SuiteCRM".
 */

if (!defined('sugarEntry') || !sugarEntry) {
    die('Not A Valid Entry Point');
}

$mod_strings = array(
    'LBL_LOADING' => 'جاري التحميل' /*for 508 compliance fix*/,
    'LBL_HIDEOPTIONS' => 'إخفاء الخيارات' /*for 508 compliance fix*/,
    'LBL_DELETE' => 'حذف' /*for 508 compliance fix*/,
    'help' => array(
        'package' => array(
            'create' => 'أدخل <b>اسمًا</b> للحزمة. يجب أن يتكون الاسم الذي تدخله من أحرف أبجديًة وأرقام وأن لا يحتوي على مسافات. (مثال: HR_Management) <br/> <br/> يمكنك تقديم معلومات <b>المؤلف</b> و <b>الوصف</b> للحزمة. <br/> <br/> انقر <b>حفظ</b> لإنشاء الحزمة.',
            'modify' => 'تظهر الخصائص والإجراءات الممكنة <b>للحزمة </b> هنا. <br> <br> يمكنك تعديل <b>الاسم</b> و <b>المؤلف</b> و <b>الوصف</b> لللحزمة، بالإضافة إلى عرض وتخصيص كافة الوحدات الموجودة في الحزمة. <br> <br> انقر <b>وحدة جديدة</b> لإنشاء وحدة للحزمة. <br> <br> إذا كانت الحزمة تحتوي على وحدة واحدة على الأقل، فيمكنك <b>نشر</b> و <b>تنفيذ</b> الحزمة، بالإضافة إلى <b>تصدير</b> التخصيصات التي تم إجراؤها في الحزمة.',
            'name' => 'هذا هو <b>اسم</b> الحزمة الحالية. <br/> <br/> يجب أن يتكون الاسم الذي تدخله من أحرف أبجديًة وأرقام، وأن يبدأ بحرف وأن لا يحتوي على مسافات. (مثال: HR_Management)',
            'author' => 'هذا هو <b>المؤلف</b> الذي يتم عرضه أثناء التثبيت كاسم الكيان الذي أنشأ الحزمة. <br> <br> قد يكون المؤلف فردًا أو شركة.',
            'description' => 'هذا هو <b>وصف</b> الحزمة التي يتم عرضها أثناء التثبيت.',
            'publishbtn' => 'انقر <b>نشر</b> لحفظ جميع البيانات المدخلة ولإنشاء ملف .zip وهو إصدار قابل للتثبيت من الحزمة. <br> <br> استخدم <b>أداة رفع الوحدات</b> لتحميل ملف .zip وقم بتثبيت الحزمة.',
            'deploybtn' => 'انقر <b>نشر</b> لحفظ جميع البيانات المدخلة وتثبيت الحزمة، بما في ذلك جميع الوحدات، في النسخة الحالية.',
            'duplicatebtn' => 'انقر <b>تكرار</b> لنسخ محتويات الحزمة إلى حزمة جديدة ولعرض الحزمة الجديدة. <br/><br/>بالنسبة للحزمة الجديدة، سيتم إنشاء اسم جديد تلقائياً عن طريق إضافة رقم إلى نهاية اسم الحزمة المستخدمة لإنشاء الحزمة الجديدة. يمكنك إعادة تسمية الحزمة الجديدة بإدخال اسم جديد <b></b> والنقر على <b>حفظ</b>.',
            'exportbtn' => 'انقر <b>تصدير</b> لإنشاء ملف .zip يحتوي على التخصيصات التي أجريت في الحزمة.<br><br> الملف الذي تم إنشاؤه ليس نسخة قابلة للتثبيت من الحزمة.<br><br>استخدم <b>أدارة رفع الوحدات</b> لاستيراد الملف المضغوط .zip وللحصول على الحزمة، بما في ذلك التخصيصات، تظهر في وحدة بناء الوحدات.',
            'deletebtn' => 'انقر <b>حذف</b> لحذف هذه الحزمة وجميع الملفات ذات الصلة بهذه الحزمة.',
            'savebtn' => 'انقر <b>حفظ</b> لحفظ جميع البيانات المدخلة ذات الصلة بالحزمة.',
            'existing_module' => 'انقر أيقونة <b>الوحدة</b> لتحرير الخصائص وتخصيص الحقول والعلاقات والتصاميم المرتبطة بالوحدة.',
            'new_module' => 'انقر <b>وحدة جديدة</b> لإنشاء وحدة جديدة لهذه الحزمة.',
            'key' => 'سيتم استخدام هذا <b>المفتاح</b> ذو الخمسة أحرف الأبجدية والرقمية لبادئة جميع المجلدات، وأسماء الدالات وجداول قواعد البيانات لجميع الوحدات في الحزمة الحالية.<br><br>يستخدم المفتاح في محاولة لحصول على أسماء جداول فريدة.',
            'readme' => 'انقر لإضافة نص <b>Readme</b> توضيحي لهذه الحزمة.<br><br>سيكون النص التوضيحي متاحا وقت التثبيت.',

        ),
        'main' => array(),
        'module' => array(
            'create' => 'أدخل <b>اسمًا</b> للوحدة. <b>التسمية</b> التي ستخلها ستظهر في علامة التبويب الخاصة بالتنقل. <br/><br/>اختر عرض علامة تبويب للتنقل خاصة بالوحدة من خلال التأشير على مربع اختيار <b>علامة التبويب للتنقل</b>.<br/><br/>ثم اختر نوع الوحدة التي ترغب في إنشائها. <br/><br/>حدد نوع القالب. يحتوي كل قالب على مجموعة محددة من الحقول، بالإضافة إلى تصاميم محددة مسبقا يمكن استخدامها كأساس للوحدة الخاصة بك. <br/><br/>انقر <b>حفظ</b> لإنشاء الوحدة.',
            'modify' => 'يمكنك تغيير خصائص الوحدة أو تخصيص <b>الحقول</b> و<b>العلاقات</b> و <b>التصاميم</b> المتصلة بالوحدة.',
            'importable' => 'التأشير على مربع اختيار <b>قابل للاستيراد</b> سيفعل خاصية الاستيراد لهذه الوحدة.<br><br>سيظهر رابط للمساعد الآلي للاستيراد في لوحة الاختصارات في الوحدة. يقوم المساعد الآلي للاستيراد بتيسير استيراد البيانات من مصادر خارجية إلى الوحدة المخصصة.',
            'team_security' => 'التأشير على مربع اختيار <b>أمن الفريق</b> سيفعل خاصية أمن الفريق لهذه الوحدة. <br/><br/>إذا تم تفعيل خاصية أمن الفريق، فسيظهر حقل اختيار الفريق داخل السجلات في الوحدة ',
            'reportable' => 'التأشير على مربع الاختيار هذا سيسمح لهذه الوحدة بتشغيل التقارير الخاصة به.',
            'assignable' => 'التأشير على مربع الاختيار هذا سيسمح بإسناد سجل في هذه الوحدة إلى مستخدم محدد.',
            'has_tab' => 'تحديد <b>علامة التبويب للتنقل</b> سوف يوفر علامة تبويب للتنقل خاصة بالوحدة.',
            'acl' => 'تحديد هذا المربع سيفعّل خاصية ضوابط الوصول لهذه الوحدة، بما في ذلك الأمن على مستوى الحقول.',
            'studio' => 'تحديد هذا المربع سيسمح لمدراء النظام بتخصيص هذه الوحدة داخل الاستوديو.',
            'audit' => 'سيؤدي تحديد هذا المربع إلى تفعيل خاصية التدقيق لهذه الوحدة. سيتم تسجيل التغييرات في حقول معينة بحيث يمكن لمدراء النظام مراجعة سجل التغيير.',
            'viewfieldsbtn' => 'انقر <b>عرض الحقول</b> لعرض الحقول المرتبطة بالوحدة ولإنشاء وتعديل الحقول المخصصة.',
            'viewrelsbtn' => 'انقر <b>عرض العلاقات</b> لعرض العلاقات المرتبطة بهذه الوحدة ولإنشاء علاقات جديدة.',
            'viewlayoutsbtn' => 'انقر <b>عرض التصاميم</b> لعرض تصاميم الوحدة وتخصيص ترتيب الحقول داخل التصاميم.',
            'duplicatebtn' => 'انقر <b>تكرار</b> لنسخ خصائص الوحدة إلى وحدة جديدة ولعرض الوحدة الجديدة. <br/><br/>سيتم إنشاء اسم جديد للوحدة الجديدة تلقائياً عن طريق إضافة رقم إلى نهاية اسم الوحدة المستخدمة لإنشاء الوحدة الجديدة.',
            'deletebtn' => 'انقر <b>حذف</b> لحذف هذه الوحدة.',
            'name' => 'هذا هو <b>اسم</b> الوحدة الحالية.<br/><br/>يجب أن يكون الاسم أبجدي رقمي ويجب أن يبدأ بحرف ولا يحتوي على أي مسافات. (مثال: HR_Managee)',
            'label' => 'هذه هي <b>تسمية</b> التي ستظهر في علامة التبويب للتنقل الخاصة بالوحدة. ',
            'savebtn' => 'انقر <b>حفظ</b> لحفظ جميع البيانات المدخلة ذات الصلة بالوحدة.',
            'type_basic' => 'يوفر نوع القالب <b>البسيط</b> حقول أساسية، مثل حقول الاسم، و المسند إليه، والفريق، وتاريخ الإنشاء، والوصف.',
            'type_company' => 'يوفر نوع قالب <b>الشركة</b> حقول خاصة بكل منظمة، مثل اسم الشركة والصناعة وعنوان الفوترة.<br/><br/>استخدم هذا القالب لإنشاء وحدات مشابهة لوحدة الحسابات القياسية.',
            'type_issue' => 'يوفر نوع قالب <b>المشكلة</b> حقول محددة للقضايا و الأخطاء البرمجية، مثل الرقم والحالة والأولوية والوصف.<br/><br/>استخدم هذا القالب لإنشاء وحدات مشابهة لوحدات القضايا والأخطاء البرمجية القياسية.',
            'type_person' => 'يوفر نوع قالب <b>الشخص</b> حقول محددة للأفراد، مثل بادئة الاسم، واللقب، والاسم، والعنوان ورقم الهاتف.<br/><br/>استخدم هذا القالب لإنشاء وحدات مشابهة لوحدات جهات الاتصال والعملاء المحتملون القياسية.',
            'type_sale' => 'يوفر نوع قالب <b>البيع</b> حقول محددة للفرص، مثل مصدر العميل المحتمل، والمنصة، والمبلغ والاحتمالية. <br/><br/>استخدم هذا القالب لإنشاء وحدات مشابهة لوحدة الفرص القياسية.',
            'type_file' => 'يوفر قالب <b>الملف</b> حقول خاصة بالوثائق، مثل اسم الملف، ونوع الوثيقة، وتاريخ النشر.<br><br>استخدم هذا القالب لإنشاء وحدات مشابهة لوحدة الوثائق القياسية.',

        ),
        'dropdowns' => array(
            'default' => 'كل <b>القوائم المنسدلة</b> للنظام مدرجة هنا.<br><br>يمكن استخدام القوائم المنسدلة للحقول ذات القوائم المنسدلة في أي وحدة.<br><br>لإجراء تغييرات على القائمة المنسدلة، انقر على اسم القائمة المنسدلة.<br><br>انقر <b>أضف قائمة منسدلة</b> لإنشاء قائمة منسدلة جديدة.',
            'editdropdown' => 'يمكن استخدام القوائم المنسدلة للحقول ذات القوائم المنسدلة القياسية أو المخصصة في أي وحدة.<br><br>أدخل <b>اسما</b> للقائمة المنسدلة.<br><br>إذا تم تثبيت أي حزم لغة في النظام، يمكنك تحديد <b>اللغة</b> المستخدمة لعناصر القائمة.<br><br>في حقل <b>اسم العنصر</b> ، قم بتوفير اسم للخيار في القائمة المنسدلة. هذا الاسم لن يظهر في القائمة المنسدلة المعروضة للمستخدمين.<br><br>في حقل <b>التسمية المعروضة</b> أدخل التسمية التي ستعرض للمستخدمين.<br><br>بعد تقديم اسم العنصر والتسية المعروضة، انقر <b>إضافة</b> لإضافة العنصر إلى القائمة المنسدلة.<br><br>لإعادة ترتيب العناصر في القائمة، قم بسحب وإسقاط العناصر إلى المواقع المطلوبة.<br><br>لتحرير التسمية المعروضة للعنصر, انقر <b>أيقونة التحرير</b>و أدخل تسمية معروضة جديدة. لحذف عنصر من القائمة المنسدلة، انقر <b> أيقونة الحذف</b>.<br><br>للتراجع عن تغيير أجري على التسمية المعروضة، انقر <b>التراجع</b>. لإعادة إجراء تغيير تم التراجع عنه، انقر <b>إعادة</b><br><br>اضغط <b>حفظ</b> لحفظ القائمة المنسدلة.',

        ),
        'subPanelEditor' => array(
            'modify' => 'كل الحقول التي يمكن عرضها في <b>التطبيق الفرعي</b> تظهر هنا.<br><br>يحتوي العمود <b>الافتراضي</b> على الحقول التي يتم عرضها في التطبيق الفرعي.<br/><br/>العمود <b>المخفي</b> يحتوي على حقول يمكن إضافتها إلى العمود الافتراضي.'
        ,
            'savebtn' => 'انقر <b>حفظ وتنفيذ</b> لحفظ التغييرات التي قمت بها وجعلها نشطة داخل الوحدة.',
            'historyBtn' => 'انقر فوق <b>عرض التاريخ</b> لعرض واستعادة تصميم محفوظ سابقا من السجل التاريخي.',
            'historyDefault' => 'انقر فوق <b>استعادة الافتراضي</b> لاستعادة طريقة العرض إلى تصميمها الأصلي.',
            'Hidden' => 'الحقول <b>المخفية</b> لا تظهر في التطبيق الفرعي.',
            'Default' => '<b>الحقول الافتراضية</b> تظهر في التطبيق الفرعي.',

        ),
        'listViewEditor' => array(
            'modify' => 'كل الحقول التي يمكن عرضها في <b>طريقة عرض القائمة</b> تظهر هنا.<br><br>يحتوي العمود <b>الافتراضي</b> على الحقول التي يتم عرضها في القائمة بشكل افتراضي.<br/><br/>العمود <b>متاح</b> يحتوي على حقول يمكن للمستخدم أن يحددها في البحث لإنشاء عرض مخصص للقائمة <br/><br/>يحتوي العمود <b>المخفي</b> على الحقول التي يمكن إضافتها إلى العمود الافتراضي أو المتاح.'
        ,
            'savebtn' => 'انقر <b>حفظ وتنفيذ</b> لحفظ التغييرات التي قمت بها وجعلها نشطة داخل الوحدة.',
            'historyBtn' => 'انقر فوق <b>عرض التاريخ</b> لعرض واستعادة تصميم محفوظ سابقا من السجل التاريخي.<br><br><b>الاستعادة</b> في <b>عرض التاريخ</b> تستعيد وضع الحقل داخل التصاميم المحفوظة سابقا. لتغيير تسميات العرض للحقول، انقر أيقونة التحرير بجوار كل حقل من الحقول.',
            'historyDefault' => 'انقر <b>استعادة الافتراضي</b> لاستعادة طريقة العرض إلى تصميمها الأصلي.<br><br><b>استعادة الافتراضي</b> تستعيد فقط وضع الحقل داخل التصميم الأصلي. لتغيير تسميات العرض للحقول، انقر فوق أيقونة التحرير بجوار كل حقل من الحقول.',
            'Hidden' => 'مشاهدة الحقول <b>المخفية</b> غير متوفرة حاليا للمستخدمين في طريقة عرض القوائم.',
            'Available' => 'الحقول <b>المتاحة</b> لا تظهر بشكل افتراضي، ولكن يمكن إضافتها إلى طريقة عرض القوائم من قبل المستخدمين.',
            'Default' => 'الحقول <b>الافتراضية</b> تظهر في طريقة عرض القوائم التي لم يتم تخصيصها من قبل المستخدمين.'
        ),
        'popupListViewEditor' => array(
            'modify' => 'كل الحقول التي يمكن عرضها في <b>طريقة عرض القوائم</b> تظهر هنا.<br><br>يحتوي العمود <b>الافتراضي</b> على الحقول التي يتم عرضها في طريقة عرض القوائم بشكل افتراضي.<br/><br/> <b>العمود المخفي</b> يحتوي على الحقول التي يمكن إضافتها إلى العمود الافتراضي أو المتاح.'
        ,
            'savebtn' => 'انقر <b>حفظ وتنفيذ</b> لحفظ التغييرات التي قمت بها وجعلها نشطة داخل الوحدة.',
            'historyBtn' => 'انقر فوق <b>عرض التاريخ</b> لعرض واستعادة تصميم محفوظ سابقا من السجل التاريخي.<br><br><b>الاستعادة</b> في <b>عرض التاريخ</b> تستعيد وضع الحقل داخل التصاميم المحفوظة سابقا. لتغيير تسميات العرض للحقول، انقر أيقونة التحرير بجوار كل حقل من الحقول.',
            'historyDefault' => 'انقر <b>استعادة الافتراضي</b> لاستعادة طريقة العرض إلى تصميمها الأصلي.<br><br><b>استعادة الافتراضي</b> تستعيد فقط وضع الحقل داخل التصميم الأصلي. لتغيير تسميات العرض للحقول، انقر فوق أيقونة التحرير بجوار كل حقل من الحقول.',
            'Hidden' => 'مشاهدة الحقول <b>المخفية</b> غير متوفرة حاليا للمستخدمين في طريقة عرض القوائم.',
            'Default' => 'الحقول <b>الافتراضية</b> تظهر في طريقة عرض القوائم التي لم يتم تخصيصها من قبل المستخدمين.'
        ),
        'searchViewEditor' => array(
            'modify' => 'كل الحقول التي يمكن عرضها في نموذج <b>الفرز</b> تظهر هنا.<br><br>يحتوي العمود <b>الافتراضي</b> على الحقول التي سيتم عرضها في نموذج البحث.<br/><br/>العمود <b>المخفي</b> يحتوي على الحقول المتاحة لك كمدير للنظام لإضافتها إلى نموذج البحث.'
        ,
            'savebtn' => 'النقر على <b>حفظ وتنفيذ</b> سيحفظ جميع التغييرات ويجعلها نشطة',
            'Hidden' => 'الحقول <b>المخفية</b> لا تظهر في البحث.',
            'historyBtn' => 'انقر فوق <b>عرض التاريخ</b> لعرض واستعادة تصميم محفوظ سابقا من السجل التاريخي.<br><br><b>الاستعادة</b> في <b>عرض التاريخ</b> تستعيد وضع الحقل داخل التصاميم المحفوظة سابقا. لتغيير تسميات العرض للحقول، انقر أيقونة التحرير بجوار كل حقل من الحقول.',
            'historyDefault' => 'انقر <b>استعادة الافتراضي</b> لاستعادة طريقة العرض إلى تصميمها الأصلي.<br><br><b>استعادة الافتراضي</b> تستعيد فقط وضع الحقل داخل التصميم الأصلي. لتغيير تسميات العرض للحقول، انقر فوق أيقونة التحرير بجوار كل حقل من الحقول.',
            'Default' => '<b>الحقول الافتراضية</b> تظهر في البحث.'
        ),
        'layoutEditor' => array(
            'defaultdetailview' => 'منطقة <b>التصميم</b> تحتوي على الحقول التي يتم عرضها حاليا ضمن <b>طريقة العرض الافتراضية</b>.<br/><br/><b>صندوق الأدوات</b> يحتوي على <b>سلة المحذوفات</b> والحقول وعناصر التصميم التي يمكن إضافتها إلى التصميم.<br><br>إجراء تغييرات على التصميم من خلال سحب العناصر و الحقول بين <b>صندوق الأدوات</b> و <b>التصميم</b> و داخل التصميم نفسه.<br><br>لإزالة حقل من التصميم، اسحب الحقل إلى <b>سلة المحذوفات</b>. وبعد ذلك سيكون الحقل متاحا في صندوق الأدوات لإضافته إلى التضميم.',
            'defaultquickcreate' => 'منطقة <b>التصميم</b> تحتوي على الحقول التي يتم عرضها حاليا في نموذج 
<b> الإنشاء السريع (QuickCreate)</b>.<br><br>نموذج الإنشاء السريع (QuickCreate) يظهر في التطبيقات الفرعية للوحدة عندما يتم النقر على زر الإنشاء.<br/><br/>صندوق الأدوات <b></b> تحتوي على <b>سلة المحذوفات</b> والحقول وعناصر التصميم التي يمكن إضافتها إلى التصميم.<br><br>إجراء تغييرات على التصميم من خلال سحب العناصر و الحقول بين صندوق الأدوات <b></b> و <b>التصميم</b> و داخل التصميم نفسه.<br><br>لإزالة حقل من التصميم، اسحب الحقل إلى <b>سلة المحذوفات</b>. وبعد ذلك سيكون الحقل متاحا في صندوق الأدوات لإضافته إلى التصميم.',
            //this default will be used for edit view
            'default' => 'منطقة <b>التصميم</b> تحتوي على الحقول التي يتم عرضها حاليا في <b>طريقة عرض التحرير</b>.<br/><br/><b>علبة الأدوات</b> تحتوي على <b>سلة المحذوفات</b> والحقول وعناصر التصميم التي يمكن إضافتها إلى التصميم.<br><br>إجراء تغييرات على التصميم من خلال سحب العناصر و الحقول بين <b>صندوق الأدوات</b> و <b>التصميم</b> و داخل التصميم نفسه.<br><br>لإزالة حقل من التصميم، اسحب الحقل إلى <b>سلة المحذوفات</b>. وبعد ذلك سيكون الحقل متاحا في صندوق الأدوات لإضافته إلى التصميم.',
            'saveBtn' => 'انقر فوق <b>حفظ</b> للحفاظ على التغييرات التي قمت بها في التصميم منذ آخر مرة قمت بحفظها.<br><br>لن يتم عرض التغييرات في الوحدة حتى تقوم بتنفيذ التغييرات المحفوظة.',
            'historyBtn' => 'انقر فوق <b>عرض التاريخ</b> لعرض واستعادة تصميم محفوظ سابقا من السجل التاريخي.<br><br><b>الاستعادة</b> في <b>عرض التاريخ</b> تستعيد وضع الحقل داخل التصاميم المحفوظة سابقا. لتغيير تسميات العرض للحقول، انقر أيقونة التحرير بجوار كل حقل من الحقول.',
            'historyDefault' => 'انقر <b>استعادة الافتراضي</b> لاستعادة طريقة العرض إلى تصميمها الأصلي.<br><br><b>استعادة الافتراضي</b> تستعيد فقط وضع الحقل داخل التصميم الأصلي. لتغيير تسميات العرض للحقول، انقر فوق أيقونة التحرير بجوار كل حقل من الحقول.',
            'publishBtn' => 'انقر فوق <b>حفظ وتنفيذ</b> لحفظ جميع التغييرات التي أجريتها على التصميم منذ آخر مرة قمت بحفظها، ولجعل التغييرات نشطة في الوحدة.<br><br>سيتم عرض التصميم على الفور في الوحدة.',
            'toolbox' => '<b>صندوق الأدوات</b> يحتوي على <b>سلة المحذوفات</b>، وعناصر تصميم إضافية ومجموعة الحقول المتاحة لإضافتها إلى التصميم.<br/><br/>يمكن سحب عناصر التصميم والحقول في صندوق الأدوات وإسقاطها في التصميم، ويمكن سحب عناصر التصميم والحقول وإسقاطها من التصميم إلى صندوق الأدوات.<br><br>عناصر التصميم هي <b>لوحات</b> و <b>صفوف</b>. إن إضافة صف جديد أو لوحة جديدة إلى التصميم يوفر مواقع إضافية في التصميم للحقول.<br/><br/>قم بسحب وإسقاط أي من الحقول الموجودة في صندوق الأدوات أو التصميم في موقع حقل مشغول لمبادلة مواقع الحقلين.<br/><br/>حقل <b>الفرز</b> ينشئ مساحة فارغة في التصميم حيث يتم وضعه.',
            'panels' => 'توفر منطقة <b>التصميم</b> طريقة عرض لكيفية ظهور التصميم داخل الوحدة عندما يتم تنفيذ التغييرات التي أجريت على التصميم.<br/><br/>يمكنك إعادة وضع الحقول والصفوف واللوحات بسحبها وإسقاطها في الموقع المطلوب.<br/><br/>إزالة العناصر عن طريق سحبها وإسقاطها في <b>سلة المحذوفات</b> في صندوق الأدوات، أو إضافة عناصر وحقول جديدة عن طريق سحبها من علبة الأدوات <b></b>ث وإسقاطها في الموقع المطلوب في التصميم.',
            'delete' => 'قم بسحب وإسقاط أي عنصر هنا لإزالته من التصميم',
            'property' => 'تحرير التسمية المعروضة لهذا الحقل. <br/><b>ترتيب التبويب</b> يتحكم في ترتيب التنقل بين الحقول عند الضغط على مفتاح (Tab) على لوحة المفاتيح.',
        ),
        'fieldsEditor' => array(
            'default' => '<b>الحقول</b> المتوفرة للوحدة موجودة هنا بحسب اسم الحقل.<br><br>الحقول المخصصة التي تم إنشاؤها للوحدة تظهر فوق الحقول المتاحة للوحدة بشكل افتراضي.<br><br>لتحرير حقل ما، انقر <b>اسم الحقل</b>.<br/><br/>لإنشاء حقل جديد، انقر فوق <b>إضافة حقل</b>.',
            'mbDefault' => '<b>الحقول</b> المتوفرة للوحدة موجودة هنا بحسب اسم الحقل.<br><br>لتهيئة الخصائص للحقل، انقر اسم الحقل.<br><br>لإنشاء حقل جديد، انقر <b>إضافة حقل</b>. يمكن تعديل التسمية مع الخصائص الأخرى للحقل الجديد بعد الإنشاء بالنقر على اسم الحقل.<br><br>بعد نشر الوحدة، الحقول الجديدة التي تم إنشاؤها في وحدة البناء تعتبر حقول قياسية في الوحدة المنشورة في الاستوديو.',
            'addField' => 'حدد <b>نوع البيانات</b> للحقل الجديد. النوع الذي تحدده يحدد نوع الأحرف التي يمكن إدخالها للحقل. على سبيل المثال، الأرقام التي هي عدد صحيح فقط يمكن إدخالها في الحقول التي هي من نوع البيانات الصحيحة.<br><br> أدخل <b>اسمًا</b> للحقل. يجب أن يكون الاسم أبجدي رقمي ويجب ألا يحتوي على أي مسافات. الشرطات السفلية (_) مقبولة.<br><br> <b>التسمية المعروضة</b> هي التسمية التي ستظهر للحقول في تصاميم الوحدة. <b>تسمية النظام</b> تستخدم للإشارة إلى الحقل في الشفرة البرمجية.<br><br> اعتمادا على نوع البيانات المختارة للحقل يمكن تعيين بعض أو كل الخصائص التالية للحقل:<br><br> <b>نص المساعدة</b> يظهر مؤقتاً بينما يتنقل المستخدم عبر الحقل ويمكن استخدامه لتوجيه المستخدم إلى نوع الإدخال المطلوب.<br><br> <b>نص التعليق</b> يظهر فقط في الاستوديو وأداة بناء الوحدات، ويمكن استخدامها لوصف الحقل لمدراء النظام.<br><br> <b>القيمة الافتراضية</b> ستظهر داخل الحقل. يمكن للمستخدمين إدخال قيمة جديدة في الحقل أو استخدام القيمة الافتراضية.<br><br> أشر على مربع اختيار <b>التحديث الشامل</b> لكي تتمكن من استخدام ميزة التحديث الجماعي للحقل.<br><br> <b>الحد الأقصى للحجم</b> يحدد الحد الأقصى لعدد الأحرف التي يمكن إدخالها في الحقل.<br><br> أشر على مربع اختيار <b>حقل إلزامي</b> لجعل الحقل إلزاميًا. يجب توفير قيمة للحقل من أجل التمكن من حفظ سجل يحتوي على الحقل.<br><br> أشر على مربع اختيار <b>متاح للتقارير</b> من أجل السماح باستخدام الحقل للفرز وعرض البيانات في التقارير.<br><br> أشر على مربع اختيار <b>التدقيق</b> من أجل التمكن من تتبع التغييرات على الحقل في سجل التغيير.<br><br>حدد خياراً من خيارات <b>حقل قابل للاستيراد</b> للسماح، أو منع أو الإلزام باستيراد الحقل في المساعد الآلي للاستيراد.<br><br>حدد خيارًا في حقل <b>الدمج المكرر</b> لتفعيل أو تعطيل ميزات الدمج المكرر والعثور على التكرار.<br><br>يمكن تعيين خصائص إضافية لأنواع معينة من البيانات.',
            'editField' => 'يمكن تخصيص خصائص هذا الحقل.<br><br>انقر <b>استنساخ</b> لإنشاء حقل جديد بنفس الخواص.',
            'mbeditField' => '<b>تسمية العرض</b> لحقل قالب يمكن تخصيصها. الخصائص الأخرى للحقل لا يمكن تخصيصها.<br><br>انقر فوق <b>استنساخ</b> لإنشاء حقل جديد بنفس الخواص.<br><br>لإزالة حقل من حقول القالب بحيث لا يعرض في الوحدة، احذف الحقل من <b>التصاميم</b> المناسبة.'

        ),
        'exportcustom' => array(
            'exportHelp' => 'صدّر التخصيصات التي أجريت في الاستوديو عن طريق إنشاء حزم يمكن رفعها إلى نسخة SuiteCRM أخرى من خلال <b>أداة رفع الوحدات</b>.<br><br>  أولا، أدخل <b>اسم الحزمة</b>. يمكنك إدحال معلومات <b>المؤلف</b> و <b>الوصف</b> للحزمة أيضًا.<br><br>حدد الوحدة (الوحدات) التي تحتوي على التخصيصات التي ترغب في تصديرها. الوحدات التي تحتوي على تخصيصات هي فقط التي ستظهر لك لاختيارها.<br><br>ثم انقر على <b>تصدير</b> لإنشاء ملف مضغوط zip للحزمة التي تحتوي على التخصيصات.',
            'exportCustomBtn' => 'انقر على <b>تصدير</b> لإنشاء ملف .zip للحزمة التي تحتوي على التخصيصات التي ترغب في تصديرها.',
            'name' => 'هذا هو <b>اسم</b> الحزمة. سيتم عرض هذا الاسم أثناء التثبيت.',
            'author' => 'هذا هو <b>المؤلف</b> الذي يتم عرضه أثناء التثبيت كاسم الكيان الذي أنشأ الحزمة. قد يكون المؤلف فردا أو شركة.',
            'description' => 'هذا هو <b>وصف</b> الحزمة التي يتم عرضها أثناء التثبيت.',
        ),
        'studioWizard' => array(
            'mainHelp' => 'مرحبا بك في منطقة <b>أدوات المطور</b> <br/><br/>استخدم الأدوات داخل هذه المنطقة لإنشاء وإدارة وحدات وحقول معيارية ومخصصة.',
            'studioBtn' => 'استخدم <b>الاستوديو</b> لتخصيص الوحدات المنفذة.',
            'mbBtn' => 'استخدم <b>أداة بناء الوحدات</b> لإنشاء وحدات جديدة.',
            'sugarPortalBtn' => 'استخدم <b>محرر بوابة SuiteCRM</b> لإدارة وتخصيص بوابة SuiteCRM.',
            'dropDownEditorBtn' => 'استخدم <b>المحرر القوائم المنسدلة</b> لإضافة وتحرير القوائم المنسدلة للحقول المنسدلة على مستوى النظام ككل.',
            'appBtn' => 'وضع التطبيق هو المكان الذي يمكنك فيه تخصيص خصائص مختلفة للبرنامج، مثل عدد تقارير مواصفات إجراء الاختبارات (TPS) المعروضة على الصفحة الرئيسية',
            'backBtn' => 'العودة إلى الخطوة السابقة.',
            'studioHelp' => 'استخدم <b>الاستوديو</b> لتحديد المعلومات التي يتم عرضها في الوحدات وكيفية عرضها.',
            'moduleBtn' => 'انقر لتعديل هذه الوحدة.',
            'moduleHelp' => 'المكونات التي يمكنك تخصيصها للوحدة تظهر هنا.<br><br>انقر أيقونة لتحديد المكون الذي ترغب بتحريره.',
            'fieldsBtn' => 'إنشاء وتخصيص <b>حقول</b> لتخزين المعلومات في الوحدة.',
            'labelsBtn' => 'تحرير <b>التسميات</b> التي تعرض للحقول والعناوين الأخرى في الوحدة.',
            'relationshipsBtn' => 'إضافة <b>علاقات</b> جديدة أو عرض العلاقات القائمة للوحدة.',
            'layoutsBtn' => 'تخصيص وحدة <b>التصاميم</b>. التصاميم هي طرق العرض المختلفة للوحدة التي تحتوي على حقول.<br><br>يمكنك تحديد الحقول التي تظهر وكيفية تنظيمها في كل تصميم.',
            'subpanelBtn' => 'تحديد الحقول التي تظهر في <b>التطبيقات الفرعية</b> في الوحدة.',
            'portalBtn' => 'تخصيص <b>تصاميم</b> الوحدة التي تظهر في <b>بوابة SuiteCRM</b>.',
            'layoutsHelp' => '<b>تصاميم</b> الوحدة التي يمكن تخصيصها تظهر هنا.<br><br>تعرض التصاميم الحقول وبيانات الحقول<br><br>انقر أيقونة لتحديد التصميم الذي ترغب بتعديله.',
            'subpanelHelp' => '<b>التطبيقات الفرعية</b> في الوحدة التي يمكن تخصيصها تظهر هنا.<br><br>انقر أيقونة لتحديد الوحدة التي ترغب بتحريرها.',
            'newPackage' => 'انقر على <b>حزمة جديدة</b> لإنشاء حزمة جديدة.',
            'exportBtn' => 'انقر على <b>تصدير التخصيصات</b> لإنشاء وتنزيل حزمة تحتوي على تخصيصات تم إجراؤها في الاستوديو لوحدات محددة.',
            'mbHelp' => 'استخدم <b>أداة بناء الوحدات</b> لإنشاء حزم تحتوي على وحدات مخصصة استنادًا إلى كائنات قياسية أو مخصصة.',
            'viewBtnEditView' => 'تخصيص تصميم <b>طريقة عرض التحرير</b> للوحدة.<br><br>طريقة عرض التحرير هي النموذج الذي يحتوي على حقول الإدخال للحصول على البيانات التي يدخلها المستخدم.',
            'viewBtnDetailView' => 'تخصيص تصميم <b>طريقة عرض التفاصيل</b> للوحدة.<br><br>طريقة عرض التفاصيل تعرض بيانات الحقول التي أدخلها المستخدم.',
            'viewBtnDashlet' => 'تخصيص <b>تطبيق SuiteCRM الفرعي</b>، بما في ذلك طريقة عرض القائمة والبحث لتطبيق SuiteCRM الفرعي.<br><br>تطبيق SuiteCRM الفرعي سيكون متاحًا للإضافة إلى الصفحات في وحدة الصفحة الرئيسية.',
            'viewBtnListView' => 'تخصيص تصميم <b>طريقة عرض القائمة</b> للوحدة.<br><br>تظهر نتائج البحث في طريقة عرض القائمة.',
            'searchBtn' => 'تخصيص تصاميم <b>البحث</b> للوحدة.<br><br>تحديد الحقول التي يمكن استخدامها لفرز السجلات التي تظهر بطريقة عرض القائمة.',
            'viewBtnQuickCreate' => 'تخصيص تصميم <b>الإنشاء السريع</b> للوحدة.<br><br>نموذج الإنشاء السريع (QuickCreate) يظهر في التظبيقات الفرعية وفي وحدة البريد الإلكتروني.',
            'addLayoutHelp' => "لإنشاء تصميم مخصص لمجموعة الأمن قم باختيار مجموعة الأمن المناسبة والتصميم الذي سيتم النسخ منه كنقطة انطلاق.",
            'searchHelp' => 'تظهر هنا نماذج <b>البحث</b> التي يمكن تخصيصها.<br><br>نماذج البحث تحتوي على حقول لفرز السجلات.<br><br>انقر أيقونة لتحديد تصميم البحث الذي ترغب بتعديله.',
            'dashletHelp' => 'تظهر هنا تصاميم <b>تطبيق SuiteCRM الفرعي</b> التي يمكن تخصيصها.<br><br>
ستكون تطبيقات SuiteCRM الفرعية متاحة للإضافة إلى الصفحات في الصفحة الرئيسية للوحدة.',
            'DashletListViewBtn' => 'تعرض <b>طريقة عرض القائمة لتطبيق SuiteCRM الفرعي</b> السجلات بناء على أدوات فرز البحث في تطبيق SuiteCRM الفرعي.',
            'DashletSearchViewBtn' => '<b>بحث تطبيق SuiteCRM الفرعي</b> يقوم بفرز السجلات لطريقة عرض القوائم لتطبيق SuiteCRM الفرعي.',
            'popupHelp' => 'تظهر هنا <b>النوافذ المنبثقة</b> التي يمكن تخصيصها.<br>',
            'PopupListViewBtn' => '<b>القائمة المنبثقة</b> تعرض السجلات استنادًا إلى طرق عرض البحث المنبثقة.',
            'PopupSearchViewBtn' => '<b>البحث المنبثق</b> يعرض السجلات لطريقة عرض القائمة المنبثقة.',
            'BasicSearchBtn' => 'تخصيص نموذج <b>الفرز السريع</b> الذي يظهر في علامة التبويب الفرز السريع في منطقة البحث للوحدة.',
            'AdvancedSearchBtn' => 'تخصيص نموذج <b>الفرز المتقدم</b> الذي يظهر في علامة التبويب البحث المتقدم في منطقة البحث للوحدة.',
            'portalHelp' => 'إدارة وتخصيص <b>بوابةSuiteCRM</b>.',
            'SPUploadCSS' => 'رفع <b>ملف النمط (Style Sheet)</b> لبوابة SuiteCRM.',
            'SPSync' => '<b>مزامنة</b> التخصيصات في نسخة بوابة SuiteCRM.',
            'Layouts' => 'تخصيص <b>تصاميم</b> وحدات بوابة SuiteCRM.',
            'portalLayoutHelp' => 'تظهر الوحدات داخل بوابة SuiteCRM في هذه المنطقة.<br><br>حدد الوحدة التي ترغب بتحرير <b>التصاميم</b> لها.',
            'relationshipsHelp' => 'كل <b>العلاقات</b> الموجودة بين الوحدة والوحدات الأخرى المنفذة تظهر هنا.<br><br><b>اسم</b> العلاقة هو الاسم الذي ينشؤه النظام للعلاقة.<br><br><b>الوحدة الأساسية</b> هي الوحدة التي تملك العلاقات. فعلى سبيل المثال، تخزن في جداول قاعدة بيانات الحسابات جميع خصائص العلاقات التي تشكل وحدة الحسابات الوحدة الأساسية لها.<br><br> <b>النوع</b> هو نوع العلاقة الموجودة بين الوحدة الأساسية و <b>الوحدة ذات الصلة</b>.<br><br>انقر على عنوان العمود للفرز بحسب العمود.<br><br>انقر على صف في جدول العلاقات لعرض الخصائص المرتبطة بالعلاقة.<br><br>انقر على <b>أضف علاقة</b> لإنشاء علاقة جديدة.<br><br>يمكن إقامة علاقات بين أي وحدتين منفذتين.',
            'relationshipHelp' => 'يمكن إنشاء <b>العلاقات</b> بين الوحدة و وحدة أخرى تم تنفيذها.<br><br>يتم التعبير عن العلاقات بصريا من خلال تطبيقات فرعية وترتبط بالحقول ذات الصلة في سجلات الوحدة.<br><br>حدد واحدة من <b>أنواع</b> العلاقات التالية بين الوحدات:<br><br> <b>واحد إلى واحد</b> - سجلات كلتا الوحدتين سوف تحتوي على حقول مترابطة.<br><br> <b>واحد إلى العديد</b> - سيتضمن سجل الوحدة الأساسية تطبيقا فرعيا، وسوف يحتوي سجل الوحدة ذات الصلة على حقل ذي صلة.<br><br> <b>العديد إلى العديد</b> - ستعرض سجلات كلتا الوحدتين تطبيقات فرعية.<br><br> اختر <b>الوحدة ذات الصلة</b> للعلاقة. <br><br>إذا كان نوع العلاقة يحتوي على تطبيقات فرعية، حدد طريقة عرض التطبيق الفرعي للوحدات.<br><br> انقر <b>حفظ</b> لإنشاء العلاقة.',
            'convertLeadHelp' => 'يمكنك هنا إضافة وحدات إلى شاشة تحويل التصاميم وتعديل التصاميم الموجودة سابقا.<br/>
		 يمكنك إعادة ترتيب الوحدات عن طريق سحب صفوفها في الجدول.<br/><br/>
		<b>الوحدة:</b> اسم الوحدة.<br/><br/>
		<b>إلزامي:</b> الوحدات الإلزامية يجب إنشاؤها أو اختيارها قبل أن يتسنى تحويل العميل المحتمل.<br/><br/>
		<b>نسخ البيانات:</b> إذا تم اختياره، سيتم نسخ الحقول من العميل المحتمل إلى حقول بنفس الاسماء في السجلات المنشأة حديثا.<br/><br/>
		<b>السماح بالاختيار:</b> يمكن اختيار الوحدات ذات الحقول المرتبطة في جهات الاتصال بدلا من إنشائها خلال عملية تحويل العميل المحتمل.<br/><br/>
		<b>تحرير:</b> تعديل تصميم التحويل لهذه الوحدة.<br/><br/>
		<b>حذف:</b> حذف هذه الوحدة من تصميم التحويل<br/><br/>',


            'editDropDownBtn' => 'تحرير قائمة منسدلة على مستوى النظام ككل',
            'addDropDownBtn' => 'إضافة قائمة منسدلة جديدة على مستوى النظام ككل',
        ),
        'fieldsHelp' => array(
            'default' => '<b>الحقول</b> في الوحدة مدرجة هنا حسب اسم الحقل.<br><br>يتضمن قالب الوحدة مجموعة من الحقول محددة مسبقاً.<br><br>لإنشاء حقل جديد، انقر على <b>أضف حقل</b>.<br><br>لتحرير الحقل، انقر على <b>اسم الحقل</b>.<br/><br/>بعد تنفيذ الوحدة، تعتبر الحقول الجديدة التي تم إنشاؤها في أداة بناء الوحدات، بالإضافة إلى الحقول النموذجية، حقولا قياسية في الاستوديو.',
        ),
        'relationshipsHelp' => array(
            'default' => '<b>العلاقات</b> التي تم إنشاؤها بين الوحدة والوحدات الأخرى تظهر هنا.<br><br>العلاقة <b>اسم</b> العلاقة هو الاسم الذي ينشؤه النظام للعلاقة.<br><br>الوحدة الأساسية <b></b> هي الوحدة التي تملك العلاقات. وتخزن خصائص العلاقة في جداول قاعدة البيانات التابعة للوحدة الأساسية.<br><br> <b>النوع</b> هو نوع العلاقة الموجودة بين الوحدة الأساسية و <b>الوحدة ذات الصلة</b>.<br><br>انقر على عنوان العمود للفرز بحسب العمود.<br><br>انقر على صف في جدول العلاقة لعرض وتحرير الخصائص المرتبطة بالعلاقة.<br><br>انقر على <b>أضف علاقة</b> لإنشاء علاقة جديدة.',
            'addrelbtn' => 'مرر الفأرة فوق المساعدة لإضافة العلاقة...',
            'addRelationship' => 'يمكن إنشاء <b>العلاقات</b> بين الوحدة و وحدة مخصصة أخرى أو وحدة منفذة.<br><br> يتم التعبير عن العلاقات بصريا من خلال تطبيقات فرعية وترتبط بالحقول في سجلات الوحدة.<br><br>حدد واحدة من <b>أنواع</b> العلاقات التالية للوحدة:<br><br> <b>واحد إلى واحد</b> - سجلات كلتا الوحدتين سوف تحتوي على حقول مترابطة.<br><br> <b>واحد إلى العديد</b> - سيتضمن سجل الوحدة الأولية تطبيقا فرعيا، وسوف يحتوي سجل الوحدة ذات الصلة على حقل ذي صلة.<br><br> <b>العديد إلى العديد</b> - ستعرض سجلات كلتا الوحدتين تطبيقات فرعية.<br><br> اختر <b>الوحدة النمطية ذات الصلة</b> للعلاقة. <br><br>إذا كان نوع العلاقة يحتوي على تطبيقات فرعية، حدد طريقة عرض التطبيق الفرعي للوحدات.<br><br> انقر <b>حفظ</b> لإنشاء العلاقة.',
        ),
        'labelsHelp' => array(
            'default' => '<b>تسميات</b> الحقول والعناوين الأخرى في الوحدة يمكن تغييرها.<br><br>تحرير التسمية بالنقر داخل الحقل، وإدخال تسمية جديدة والنقر على <b>حفظ</b>.<br><br>إذا تم تثبيت أي حزم لغة في التطبيق، يمكنك تحديد <b>اللغة</b> لاستخدامها في التسميات.',
            'saveBtn' => 'انقر على <b>حفظ</b> لحفظ جميع التغييرات.',
            'publishBtn' => 'انقر على <b>حفظ وتنفيذ</b> لحفظ جميع التغييرات وجعلها نشطة.',
        ),
        'portalSync' => array(
            'default' => 'أدخل <b>رابط بوابة SuiteCRM</b> لنسخة البوابة التي ترغب بتحديثها، وانقر على <b>تنفيذ</b>.<br><br>ثم أدخل اسم مستخدم وكلمة مرور لنظام SuiteCRM صالحين ثم انقر على <b>بدء المزامنة</b>.<br><br>ستم نقل التخصيصات التي أجريت على بوابة <b>تصميم</b> SuiteCRM، بالإضافة إلى <b>ملف النمط (Style Sheet)</b> في حال تم رفع أحدهما، إلى نسخة البوابة المحددة.',
        ),
        'portalStyle' => array(
            'default' => 'يمكنك تخصيص مظهر بوابة SuiteCRM باستخدام ملف النمط (Style Sheet).<br><br>اختر <b>ملف النمط (Style Sheet)</b> للرفع.<br><br>سيتم تنفيذ ملف النمط (Style Sheet) في بوابة SuiteCRM في المرة القادمة التي يتم فيها إجراء مزامنة.',
        ),
    ),

    'assistantHelp' => array(
        'package' => array(
            //custom begin
            'nopackages' => 'لبدء مشروع ما، انقر على <b>حزمة جديدة</b> لإنشاء حزمة جديدة لإحتواء وحدة أو وحدات مخصصة خاصة بك. <br/><br/>يمكن أن تحتوي كل حزمة على وحدة واحدة أو أكثر.<br/><br/>على سبيل المثال، قد ترغب في إنشاء حزمة تحتوي على وحدة مخصصة ذات صلة بوحدة الحسابات القياسية. أو قد ترغب في إنشاء حزمة تحتوي على العديد من الوحدات الجديدة التي تعمل معا كمشروع والتي ترتبط بعضها بالبعض وبوحدات أخرى موجودة بالفعل في النظام.',
            'somepackages' => 'تعمل <b>الحزمة</b> كحاوية لوحدات مخصصة كلها جزء من مشروع واحد. يمكن أن تحتوي الحزمة على واحدة أو أكثر من <b>الوحدات</b> المخصصة التي يمكن أن تكون مرتبطة ببعضها البعض أو بوحدات أخرى في النظام.<br/><br/>بعد إنشاء حزمة لمشروعك، يمكنك إنشاء وحدات للحزمة على الفور، أو يمكنك العودة إلى إداة إنشاء الوحدات في وقت لاحق لإكمال المشروع.<br><br>عند اكتمال المشروع، يمكنك <b>تنفيذ</b> الحزمة لتثبيت الوحدات المخصصة داخل التطبيق.',
            'afterSave' => 'يجب أن تحتوي الحزمة الجديدة الخاصة بك على وحدة واحدة على الأقل. يمكنك إنشاء وحدة أو أكثر من الوحدات المخصصة في الحزمة.<br/><br/>انقر على <b>وحدة جديدة</b> لإنشاء وحدة مخصصة في هذه الحزمة.<br/><br/> بعد إنشاء وحدة واحدة على الأقل, يمكنك نشر أو تنفيذ الحزمة لجعلها متاحة لنسخة المستخدم الخاصة بك و/أو لنسخ المستخدمين الآخرين.<br/><br/> لتنفيذ الحزمة في خطوة واحدة داخل نسخة SuiteCRM الخاصة بك، انقر على <b>تنفيذ</b>.<br><br>اضغط <b>نشر</b> لحفظ الحزمة كملف zip. بعد ذلك يتم حفظ الملف المضغوط zip في النظام الخاص بك، استخدم <b>أداة رفع الوحدات</b> لرفع وتثبيت الحزمة داخل نسخة SuiteCRM الخاصة بك. <br/><br/>يمكنك توزيع الملف على المستخدمين الآخرين لتحميله وتثبيته داخل نسخ SuiteCRM الخاصة بهم.',
            'create' => 'تعمل <b>الحزمة</b> كحاوية لوحدات مخصصة كلها جزء من مشروع واحد. يمكن أن تحتوي الحزمة على واحدة أو أكثر من <b>الوحدات</b> المخصصة التي يمكن أن تكون مرتبطة ببعضها البعض أو بوحدات أخرى في النظام.<br/><br/>بعد إنشاء حزمة لمشروعك، يمكنك إنشاء وحدات للحزمة على الفور، أو يمكنك العودة إلى إداة إنشاء الوحدات في وقت لاحق لإكمال المشروع.',
        ),
        'main' => array(
            'welcome' => 'استخدم <b>أدوات المطور</b> لإنشاء وإدارة وحدات وحقول قياسية ومخصصة. <br/><br/>لإدارة الوحدات في النظام، انقر على <b>الاستوديو</b>. <br/><br/>لإنشاء وحدات مخصصة، انقر <b>أداة بناء الوحدات</b>.',
            'studioWelcome' => 'جميع الوحدات المثبتة حالياً، بما في ذلك العناصر المعيارية والمحملة من خلال الوحدات، قابلة للتخصيص داخل الاستوديو.'
        ),
        'module' => array(
            'somemodules' => "بما أن الحزمة الحالية تحتوي على وحدة واحدة على الأقل، يمكنك <b>تنفيذ</b> الوحدات في الحزمة داخل نسخة SuiteCRM الخاصة بك أو <b>نشر</b> الحزمة ليتم تثبيتها في نسخة SuiteCRM الحالية أو نسخة أخرى باستخدام <b>أداة رفع الوحدات</b>.<br/><br/>لتثبيت الحزمة مباشرة داخل نسخة SuiteCRM الخاصة بك، انقر على <b>تنفيذ</b><br><br>لإنشاء ملف مضغوط zip للحزمة يمكن تحميلها وتثبيتها في نسخة SuiteCRM الحالية وغيرها من النسخ باستخدام <b>أداة رفع الوحدات</b>، انقر على <b>نشر</b>.<br/><br/> يمكنك بناء وحدات لهذه الحزمة على مراحل، وتنفيذها أو نشرها عندما تكون على استعداد للقيام بذلك. <br/><br/>بعد نشر الحزمة أو تنفيذها، يمكنك إجراء تغييرات على خصائص الحزمة وتخصيص الوحدات أكثر. ثم قم بإعادة نشر أو إعادة تنفيذ الحزمة لتطبيق التغييرات.",
            'editView' => 'يمكنك هنا تعديل الحقول الموجودة سابقا. يمكنك إزالة أي من الحقول الموجودة أو إضافة الحقول المتاحة في اللوحة اليسرى.',
            'create' => 'عند اختيار نوع <b>نوع</b> الوحدة التي ترغب في إنشائها، ضع في اعتبارك أنواع الحقول التي ترغب في الحصول عليها داخل الوحدة. <br/><br/>كل قالب وحدة يحتوي على مجموعة من الحقول المتعلقة بنوع الوحدة المذكورة في العنوان.<br/><br/><b>أساسي</b> - يوفر الحقول الأساسية التي تظهر في الوحدات القياسية, مثل الاسم، المعين للفريق، وتاريخ الإنشاء والحقول الوصفية.<br/><br/> <b>شركة</b> - يوفر الحقول الخاصة بكل منظمة، مثل اسم الشركة ومجال العمل والفواتير. استخدم هذا القالب لإنشاء وحدات مشابهة لوحدة الحسابات القياسية.<br/><br/> <b>شخص</b> - يوفر حقول متعلقة بالإفراد، مثل بادئة الاسم، واللقب، والاسم، والعنوان ورقم الهاتف. استخدم هذا القالب لإنشاء وحدات مشابهة لوحدات جهات الاتصال القياسية والعملاء المحتملون.<br/><br/><b>مشكلة</b> - يوفر حقول محددة للقضايا و الأخطاء البرمجية، مثل الرقم والحالة والأولوية والوصف. استخدم هذا القالب لإنشاء وحدات مشابهة للوحدات القياسية للقضايا والأخطاء البرمجية.<br/><br/>ملاحظة: بعد إنشاء الوحدة، يمكنك تعديل تسميات الحقول التي يوفرها القالب، بالإضافة إلى إنشاء حقول مخصصة للإضافة إلى تصاميم الوحدة.',
            'afterSave' => 'خصص الوحدة لتناسب احتياجاتك عن طريق تحرير وإنشاء الحقول، وإنشاء علاقات مع الوحدات الأخرى وترتيب الحقول داخل التصميم.<br/><br/>لعرض حقول القالب وإدارة الحقول المخصصة داخل الوحدة، انقر علي <b>عرض الحقول</b>.<br/><br/>لإنشاء وإدارة العلاقات بين الوحدة والوحدات الأخرى، سواء كانت وحدات موجودة سابقا في النظام أو وحدات مخصصة أخرى داخل نفس الحزمة، انقر على <b>عرض العلاقات</b><br/><br/>لتحرير مخططات الوحدة، انقر علي <b>عرض التصاميم</b>. يمكنك تغيير تصميم طريقة عرض التفاصيل، وطريقة عرض التحرير وطريقة عرض القائمة للوحدة بنفس الطريقة التي نمكن تعديل للوحدات الموجودة سابقا في النظام داخل الاستوديو.<br/><br/> لإنشاء وحدة بنفس خصائص الوحدة الحالية، انقر على <b>تكرار</b>. يمكنك تخصيص الوحدة الجديدة بشكل إضافي.',
            'viewfields' => 'يمكن تخصيص الحقول الموجودة في الوحدة لتتناسب مع احتياجاتك.<br/><br/>لا يمكنك حذف الحقول القياسية، ولكن يمكنك إزالتها من التصاميم التي تريد داخل صفحات التصاميم. <br/><br/>يمكنك إنشاء حقول جديدة ذات خصائص مماثلة للحقول الموجودة بسرعة عن طريق النقر على <b>استنساخ</b> في نموذج <b>الخصائص</b>. أدخل أي خصائص جديدة، ثم انقر على <b>حفظ</b>.<br/><br/>من المستحسن أن تقوم بتعيين جميع الخصائص للحقول القياسية والحقول المخصصة قبل أن تقوم بنشر وتثبيت الحزمة التي تحتوي على الوحدة المخصصة.',
            'viewrelationships' => 'يمكنك إنشاء علاقات من نوع العديد-إلى-العديد بين الوحدة الحالية والوحدات الأخرى في الحزمة، و/أو بين الوحدة الحالية والوحدات المثبتة سابقا في النظام.<br><br> لإنشاء علاقات من نوع واحد-إلى-العديد وواحد-إلى-واحد، أنشئ حقول <b>ربط</b> و 
<b>ربط مرن (Flex Relate)</b> للوحدات.',
            'viewlayouts' => 'يمكنك التحكم في الحقول المتاحة للحصول على البيانات داخل <b>طريقة عرض التحرير</b>. يمكنك أيضا التحكم في البيانات المعروضة داخل <b>طريقة عرض التفاصيل</b>. ولا يلزم أن تتطابق طرق العرض. <br/><br/>يتم عرض نموذج الإنشاء السريع عندما يتم الضغط على <b>إنشاء</b> في تطبيق فرعي للوحدة. تصميم نموذج <b>الإنشاء السريع</b> هو بشكل افتراضي نفس تصميم الافتراضي لنموذج <b>طريقة عرض التحرير</b>. يمكنك تخصيص نموذج الإنشاء السريع بحيث يحتوي على حقول أقل و/أو مختلفة عن تصميم طريقة عرض التحرير. <br><br>يمكنك تحديد أمان الوحدة باستخدام تخصيص التصميم بالإضافة إلى <b>إدارة الأدوار</b><br><br>',
            'existingModule' => 'بعد إنشاء وتخصيص هذه الوحدة، يمكنك إنشاء وحدات إضافية أو العودة إلى الحزمة <b>لنشر</b> أو <b>تنفيذ</b> الحزمة.<br><br>لإنشاء وحدات إضافية، انقر على <b>تكرار</b> لإنشاء وحدة ذات نفس الخصائص التي للوحدة الحالية, أو الانتقال إلى الحزمة، وانقر على <b>وحدة جديدة</b>.<br><br> إذا كنت جاهزا <b>لنشر</b> أو <b>تنفيذ</b> الحزمة التي تحتوي على هذه الوحدة، ارجع إلى الحزمة للقيام بهذه بهذه العمليات. يمكنك نشر وتنفيذ حزم تحتوي على وحدة واحدة على الأقل.',
            'labels' => 'يمكن تغيير تسميات الحقول القياسية وكذلك الحقول المخصصة. تغيير تسميات الحقول لن يؤثر على البيانات المخزنة في الحقول.',
        ),
        'listViewEditor' => array(
            'modify' => 'هناك ثلاثة أعمدة معروضة على اليسار. يحتوي العمود "الافتراضي" على الحقول التي يتم عرضها في عرض القائمة بشكل افتراضي، العمود "المتاح" يحتوي على حقول يمكن أن يختار المستخدم استخدامها لإنشاء طريقةعرض قائمة مخصصة، ويحتوي العمود "المخفي" على الحقول المتاحة لك كمدير للنظام لإضافتها إلى الأعمدة الافتراضية أو المتاحة لاستخدامها من قبل المستخدمين ولكنها معطلة حاليا.',
            'savebtn' => 'النقر على <b>حفظ</b> سيحفظ جميع التغييرات ويجعلها نشطة.',
            'Hidden' => 'الحقول المخفية هي حقول غير متاحة حاليا للمستخدمين لاستخدامها في طريقة عرض القائمة.',
            'Available' => 'الحقول المتاحة هي الحقول التي لا تظهر بشكل افتراضي، ولكن يمكن تفعيلها من قبل المستخدمين.',
            'Default' => 'يتم عرض الحقول الافتراضية للمستخدمين الذين لم ينشئوا إعدادات لطريقة عرض قائمة مخصصة.'
        ),

        'searchViewEditor' => array(
            'modify' => 'هناك عمودان معروضان على اليسار. العمود "الافتراضي" يحتوي على الحقول التي سيتم عرضها في طريقة عرض البحث، ويحتوي العمود "المخفي" على الحقول المتاحة لك كمدير للنظام لإضافتها إلى طريقة العرض.',
            'savebtn' => 'النقر على <b>حفظ وتنفيذ</b> سيحفظ جميع التغييرات ويجعلها نشطة.',
            'Hidden' => 'الحقول المخفية هي الحقول التي لن تظهر في طريقة عرض البحث.',
            'Default' => 'سيتم عرض الحقول الافتراضية في طريقة عرض البحث.'
        ),
        'layoutEditor' => array(
            'default' => 'هناك عمودان معروضان على اليسار. العمود الأيمن، المسمى التصميم الحالي أو معاينة التصميم، هو المكان الذي تقوم فيه بتغيير تصميم الوحدة. العمود الأيسر بعنوان صندوق الأدوات، يحتوي على عناصر وأدوات مفيدة للاستخدام عند تحرير التصميم. <br/><br/>إذا كانت منطقة التصميم بعنوان التصميم الحالي فأنت تعمل على نسخة من التصميم المستخدم حاليا من قبل الوحدة للعرض.<br/><br/>إذا كان العنوان هو معاينة التصميم فأنت تعمل على نسخة تم إنشاؤها في وقت سابق بالنقر على زر الحفظ، وربما يكون قد تم تغييرها سابقا عن الإصدار الذي يشاهده مستخدمو هذه الوحدة.',
            'saveBtn' => 'النقر على هذا الزر يحفظ التصميم بحيث يمكنك الحفاظ على تغييراتك. عند العودة إلى هذه الوحدة ستبدأ من هذا التصميم. غير أن تصميمك لن يراه مستخدمو الوحدة حتى تنقر على زر الحفظ والنشر.',
            'publishBtn' => 'انقر فوق هذا الزر لتنفيذ التصميم. وهذا يعني أن هذا التصميم سيظهر على الفور لمستخدمي هذه الوحدة.',
            'toolbox' => 'يحتوي صندوق الأدوات على مجموعة متنوعة من الميزات المفيدة لتعديل التصميم، بما في ذلك منطقة سلة المهملات ومجموعة من العناصر الإضافية ومجموعة من الحقول المتاحة. أي من هذه يمكن سحبه وإسقاطه في التصميم.',
            'panels' => 'تظهر هذه المنطقة كيف سيظهر تصميمك لمستخدمي هذه الوحدة عندما يتم تنفيذها.<br/><br/>يمكنك إعادة ترتيب العناصر مثل الحقول والصفوف واللوحات بسحبها وإسقاطها؛ احذف العناصر عن طريق سحبها وإسقاطها في منطقة سلة المهملات في صندوق الأدوات، أو أضف عناصر جديدة عن طريق سحبها من صندوق الأدوات وإسقاطها إلى التصميم في الموضع المطلوب.'
        ),
        'dropdownEditor' => array(
            'default' => 'هناك عمودان معروضان على اليسار. العمود الأيمن، المسمى التصميم الحالي أو معاينة التصميم، هو المكان الذي تقوم فيه بتغيير تصميم الوحدة. العمود الأيسر بعنوان صندوق الأدوات، يحتوي على عناصر وأدوات مفيدة للاستخدام عند تحرير التصميم. <br/><br/>إذا كانت منطقة التصميم بعنوان التصميم الحالي فأنت تعمل على نسخة من التصميم المستخدم حاليا من قبل الوحدة للعرض.<br/><br/>إذا كان العنوان هو معاينة التصميم فأنت تعمل على نسخة تم إنشاؤها في وقت سابق بالنقر على زر الحفظ، وربما يكون قد تم تغييرها سابقا عن الإصدار الذي يشاهده مستخدمو هذه الوحدة.',
            'dropdownaddbtn' => 'النقر على هذا الزر يضيف عنصر جديد إلى القائمة المنسدلة.',

        ),
        'exportcustom' => array(
            'exportHelp' => 'التخصيص الذي يتم في الاستوديو داخل هذه النسخة يمكن تحزيمه وتنفيذه في نسخة أخرى. <br><br>أدخل <b>اسم الحزمة</b>. يمكنك إدخال معلومات <b>المؤلف</b> و <b>الوصف</b> للحزمة.<br><br>حدد الوحدة (الوحدات) التي تحتوي على التخصيصات للتصدير. (الوحدات التي تحتوي على تخصيصات هي فقط التي ستظهر لك للتحديد.)<br><br>انقر على <b>تصدير</b> لإنشاء . ملف مضغوط zip للحزمة التي تحتوي على تخصيصات. الملف المضغوط zip يمكن رفعه إلى نسخة أخرى من خلال <b>أداة رفع الوحدات</b>.',
            'exportCustomBtn' => 'انقر على <b>تصدير</b> لإنشاء ملف .zip للحزمة التي تحتوي على التخصيصات التي ترغب في تصديرها.',
            'name' => 'سيتم عرض <b>اسم</b> الحزمة في أداة رفع الوحدات بعد رفع الحزمة للتثبيت في الاستوديو.',
            'author' => '<b>المؤلف</b> هو اسم الكيان الذي أنشأ الحزمة. يمكن أن يكون المؤلف فردا أو شركة.<br><br>سيتم عرض المؤلف في أداة رفع الوحدات بعد رفع الحزمة للتثبيت في الاستوديو.',
            'description' => 'سيتم عرض <b>وصف</b> الحزمة في أداة تحميل الوحدات بعد رفع الحزمة للتثبيت في الاستوديو.',
        ),
        'studioWizard' => array(
            'mainHelp' => 'مرحبا بك في منطقة <b>أدوات المطور</b> <br/><br/>استخدم الأدوات داخل هذه المنطقة لإنشاء وإدارة وحدات وحقول معيارية ومخصصة.',
            'studioBtn' => 'استخدم <b>الاستوديو</b> لتخصيص الوحدات المثبتة عن طريق تغيير ترتيب الحقول وتحديد الحقول المتاحة وإنشاء حقول بيانات مخصصة.',
            'mbBtn' => 'استخدم <b>أداة بناء الوحدات</b> لإنشاء وحدات جديدة.',
            'appBtn' => 'استخدام وضع التطبيق لتخصيص خصائص مختلفة للبرنامج، مثل عدد تقارير مواصفات إجراء الاختبارات (TPS) المعروضة في الصفحة الرئيسية',
            'backBtn' => 'العودة إلى الخطوة السابقة.',
            'studioHelp' => 'استخدم <b>الاستوديو</b> لتخصيص الوحدات المثبتة.',
            'moduleBtn' => 'انقر لتعديل هذه الوحدة.',
            'moduleHelp' => 'حدد مكون الوحدة الذي ترغب في تعديله',
            'fieldsBtn' => 'تعديل المعلومات المخزنة في الوحدة من خلال التحكم في <b>الحقول</b> في الوحدة.<br/><br/>يمكنك تعديل وإنشاء حقول مخصصة هنا.',
            'labelsBtn' => 'انقر على <b>حفظ</b> لحفظ التسميات المخصصة الخاصة بك.',
            'layoutsBtn' => 'تخصيص <b>التصاميم</b> الخاصة بطرق عرط التحرير، والتفاصيل، والقائمة والبحث.',
            'subpanelBtn' => 'تحرير المعلومات التي تظهر في التطبيقات الفرعية لهذه الوحدة.',
            'layoutsHelp' => 'حدد <b>تصميما</b>لإجراء تعديلات عليه.<br/><br/>لتغيير التصميم الذي يحتوي على حقول بيانات لإدخال البيانات، انقر على <b>طريقة عرض التحرير</b>.<br/><br/>لتغيير التصميم الذي يعرض البيانات التي تم إدخالها في الحقول في طريقة عرض عرض التحرير، انقر على <b>طريقة عرض التفاصيل</b>.<br/><br/>لتغيير الأعمدة التي تظهر في القائمة الافتراضية، انقر على <b>طريقة عرص القائمة</b>.<br/><br/>لتغيير تصميم نموذج البحث البسيط والمتقدم، انقر على <b>البحث</b>.',
            'subpanelHelp' => 'حدد <b>التطبيق الفرعي</b> الذي ترغب بتحريره.',
            'searchHelp' => 'حدد تصميم <b>البحث</b> الذي ترغب بتعديله.',
            'newPackage' => 'انقر على <b>حزمة جديدة</b> لإنشاء حزمة جديدة.',
            'mbHelp' => '<b>مرحبا بك في أداة بناء الوحداتء.</b><br/><br/>استخدم <b>أداة بناء الوحدات</b> لإنشاء حزم تحتوي على وحدات مخصصة مبنية على كائنات قياسية أو مخصصة. <br/><br/>للبدء، انقر على <b>حزمة جديدة</b> لإنشاء حزمة جديدة، أو اختر حزمة للتحريرها.<br/><br/> تعمل <b>الحزمة</b> كحاوية للوحدات المخصصة، وتعتبر كلها جزءا من مشروع واحد. يمكن أن تحتوي الحزمة على وحدة أو أكثر من الوحدات المخصصة التي يمكن أن تكون مرتبطة ببعضها البعض أو بوحدات في النظام. <br/><br/>أمثلة: قد ترغب في إنشاء حزمة تحتوي على وحدة مخصصة مرتبطة بوحدة الحسابات القياسية. أو قد ترغب في إنشاء حزمة تحتوي على العديد من الوحدات الجديدة التي تعمل معا كمشروع والتي ترتبط بعضها بالبعض وبالوحدات في النظام.',
            'exportBtn' => 'انقر على <b>تصدير التخصيصات</b> لإنشاء حزمة تحتوي على تخصيصات تم إجراؤها في الاستوديو لوحدات محددة.',
        ),


    ),
//HOME
    'LBL_HOME_EDIT_DROPDOWNS' => 'محرر القائمة المنسدلة',

//STUDIO2
    'LBL_MODULEBUILDER' => 'أداة بناء الوحدات',
    'LBL_STUDIO' => 'ستديو',
    'LBL_DROPDOWNEDITOR' => 'محرر القائمة المنسدلة',
    'LBL_DEVELOPER_TOOLS' => 'أدوات المطور',
    'LBL_SUITEPORTAL' => 'محرر بوابة SuiteCRM',
    'LBL_PACKAGE_LIST' => 'قائمة الحزم',
    'LBL_HOME' => 'المُجلد الرئيسي',
    'LBL_NONE' => '- لا شيء-',
    'LBL_DEPLOYE_COMPLETE' => 'اكتمل التنفيذ',
    'LBL_DEPLOY_FAILED' => 'حدث خطأ أثناء عملية التنفيذ، قد لا يكون تم تثبيت الحزمة الخاصة بك بشكل صحيح',
    'LBL_AVAILABLE_SUBPANELS' => 'التطبيقات الفرعية المتاحة',
    'LBL_ADVANCED' => 'متقدم',
    'LBL_ADVANCED_SEARCH' => 'فلتر متقدم',
    'LBL_BASIC' => 'أساسي',
    'LBL_BASIC_SEARCH' => 'فلتر سريع',
    'LBL_CURRENT_LAYOUT' => 'التصميم',
    'LBL_CURRENCY' => 'العملة',
    'LBL_DASHLET' => 'تطبيق SuiteCRM الفرعي',
    'LBL_DASHLETLISTVIEW' => 'طريقة عرض القائمة لتطبيق SuiteCRM الفرعي',
    'LBL_POPUP' => 'طريقة عرض النافذة المنبثقة',
    'LBL_POPUPLISTVIEW' => 'طريقة عرض القائمة المنبثقة',
    'LBL_POPUPSEARCH' => 'البحث المنبثق',
    'LBL_DASHLETSEARCHVIEW' => 'بحث تطبيق SuiteCRM الفرعي',
    'LBL_DETAILVIEW' => 'عرض التفاصيل',
    'LBL_DROP_HERE' => '[أضفه هنا]',
    'LBL_EDIT' => 'حرر',
    'LBL_EDIT_LAYOUT' => 'تحرير التصميم',
    'LBL_EDIT_FIELDS' => 'تعديل الحقول',
    'LBL_EDITVIEW' => 'عرض للتحرير',
    'LBL_FILLER' => '(فرز)',
    'LBL_FIELDS' => 'الحقول',
    'LBL_FAILED_TO_SAVE' => 'فشل في الحفظ',
    'LBL_FAILED_PUBLISHED' => 'فشل في النشر',
    'LBL_HOMEPAGE_PREFIX' => 'الخاص بي',
    'LBL_LAYOUT_PREVIEW' => 'معاينة التصميم',
    'LBL_LAYOUTS' => 'شكل خارجي',
    'LBL_LISTVIEW' => 'عرض كقائمة',
    'LBL_MODULES' => 'الوحدات',
    'LBL_MODULE_TITLE' => 'الاستديو',
    'LBL_NEW_PACKAGE' => 'حزمة جديدة',
    'LBL_NEW_PANEL' => 'لوحة جديدة',
    'LBL_NEW_ROW' => 'صف جديد',
    'LBL_PACKAGE_DELETED' => 'تم حذف الحزمة',
    'LBL_PUBLISHING' => 'جاري النشر...',
    'LBL_PUBLISHED' => 'تم نشره',
    'LBL_SELECT_FILE' => 'حدد ملف',
    'LBL_SUBPANELS' => 'التطبيقات الفرعية',
    'LBL_SUBPANEL' => 'التطبيق الفرعي',
    'LBL_SUBPANEL_TITLE' => 'العنوان:',
    'LBL_SEARCH_FORMS' => 'بحث',
    'LBL_SEARCH' => 'بحث',
    'LBL_SEARCH_BUTTON' => 'بحث',
    'LBL_FILTER' => 'تنقيح وفلترة البيانات',
    'LBL_TOOLBOX' => 'صندوق الأدوات',
    'LBL_QUICKCREATE' => 'إنشاء سريع',
    'LBL_EDIT_DROPDOWNS' => 'تحرير قائمة منسدلة على مستوى النظام ككل',
    'LBL_ADD_DROPDOWN' => 'إضافة قائمة منسدلة جديدة على مستوى النظام ككل',
    'LBL_BLANK' => '-فارغ-',
    'LBL_TAB_ORDER' => 'ترتيب علامات التبويب (Tab)',
    'LBL_TABDEF_TYPE' => 'نوع العرض',
    'LBL_TABDEF_TYPE_HELP' => 'حدد كيفية عرض هذا القسم. هذا الخيار له تأثير فقط إذا قمت بتمكين علامات التبويب على هذا العرض.',
    'LBL_TABDEF_TYPE_OPTION_TAB' => 'علامة تبويب',
    'LBL_TABDEF_TYPE_OPTION_PANEL' => 'لوحة',
    'LBL_TABDEF_TYPE_OPTION_HELP' => 'اشر على اللوحة لجعل هذه اللوحة تعرض في عرض التصميم. حدد علامة التبويب لجعل هذه اللوحة تعرض داخل علامة تبويب منفصلة داخل التصميم. عندما يتم تحديد علامة التبويب للوحة، سيتم عرض اللوحات التالية للعرض كلوحة داخل التبويب. <br/>سيتم بدء علامة تبويب جديدة للوحة القادمة التي تم تحديد علامة التبويب لها. إذا تم تحديد علامة التبويب للوحة أسفل اللوحة الأولى، فستكون اللوحة الأولى بالضرورة علامة تبويب.',
    'LBL_TABDEF_COLLAPSE' => 'طي',
    'LBL_TABDEF_COLLAPSE_HELP' => 'حدد هذا الخيار لجعل الحالة الافتراضية لهذه اللوحة مطوية.',
    'LBL_DROPDOWN_TITLE_NAME' => 'الاسم',
    'LBL_DROPDOWN_LANGUAGE' => 'اللغة',
    'LBL_DROPDOWN_ITEMS' => 'عناصر القائمة',
    'LBL_DROPDOWN_ITEM_NAME' => 'اسم العنصر',
    'LBL_DROPDOWN_ITEM_LABEL' => 'التسمية المعروضة',
    'LBL_SYNC_TO_DETAILVIEW' => 'مزامنة مع طريقة عرض التفاصيل',
    'LBL_SYNC_TO_DETAILVIEW_HELP' => 'حدد هذا الخيار لمزامنة تصميم طريقة عرض التحرير هذه مع تصميم طريقة عرض التفاصيل المقابلة. الحقول وأماكن الحقول في طريقة عرض التحرير<br>سيتم مزامنتها وحفظها في طريقة عرض التفاصيل تلقائيا عند النقر على حفظ أو حفظ وتنفيذ في طريقة عرض التحرير.<br>لن يكون من الممكن إجراء تغييرات التصميم في طريقة عرض التفاصيل.',
    'LBL_SYNC_TO_DETAILVIEW_NOTICE' => 'طريقة عرض التفاصيل هذاه قد تم مزامنتها مع طريقة عرض التحرير.<br> الحقول وأمكان الحقول في طريقة عرض التفاصيل هذه تعكس الحقول وأماكن الحقول في طريقة عرض التحرير.<br>لا يمكن حفظ التغييرات في طريقة عرض التفاصيل أو نشرها داخل هذه الصفحة. قم بإجراء التغييرات أو إلغاء مزامنة التصاميم في طريقة عرض التحرير. ',
    'LBL_COPY_FROM_EDITVIEW' => 'نسخ من طريقة عرض التحرير',
    'LBL_DROPDOWN_BLANK_WARNING' => 'القيم إلزامية لكل من اسم العنصر والتسمية المعروضة. لإضافة عنصر فارغ، انقر على إضافة دون إدخال أي قيم لاسم العنصر والتسمية المعروضة.',
    'LBL_DROPDOWN_KEY_EXISTS' => 'المفتاح موجود بالفعل في القائمة',
    'LBL_NO_SAVE_ACTION' => 'تعذر العثور على إجراء حفظ لطريقة العرض هذه.',
    'LBL_BADLY_FORMED_DOCUMENT' => 'Studio2:establishLocation: وثيقة مبنية بطريقة خاطئة',


//RELATIONSHIPS
    'LBL_MODULE' => 'نظام فرعي',
    'LBL_LHS_MODULE' => 'الوحدة الأساسية',
    'LBL_CUSTOM_RELATIONSHIPS' => '* العلاقة تم إنشاؤها في الاستوديو',
    'LBL_RELATIONSHIPS' => 'العلاقات',
    'LBL_RELATIONSHIP_EDIT' => 'تعديل العلاقة',
    'LBL_REL_NAME' => 'الاسم',
    'LBL_REL_LABEL' => 'تسمية',
    'LBL_REL_TYPE' => 'نوع',
    'LBL_RHS_MODULE' => 'الوحدة ذات الصلة',
    'LBL_NO_RELS' => 'لا توجد علاقات',
    'LBL_RELATIONSHIP_ROLE_ENTRIES' => 'شرط اختياري',
    'LBL_RELATIONSHIP_ROLE_COLUMN' => 'العمود',
    'LBL_RELATIONSHIP_ROLE_VALUE' => 'القيمة',
    'LBL_SUBPANEL_FROM' => 'تطبيق فرعي من',
    'LBL_RELATIONSHIP_ONLY' => 'لن يتم إنشاء أي عناصر مرئية لهذه العلاقة نظرا لوجود علاقة مرئية سابقة بين هاتين الوحدتين.',
    'LBL_ONETOONE' => 'واحد إلى واحد',
    'LBL_ONETOMANY' => 'واحد إلى العديد',
    'LBL_MANYTOONE' => 'العديد إلى واحد',
    'LBL_MANYTOMANY' => 'العديد إلى العديد',


//STUDIO QUESTIONS
    'LBL_QUESTION_EDIT' => 'حدد الوحدة التي ترغب بتحريرها.',
    'LBL_QUESTION_LAYOUT' => 'حدد التصميم الذي ترغب بتحريره.',
    'LBL_QUESTION_SUBPANEL' => 'حدد التطبيق الفرعي الذي ترغب بتحريره.',
    'LBL_QUESTION_SEARCH' => 'حدد تصميم الفرز الذي ترغب بتحريره.',
    'LBL_QUESTION_MODULE' => 'حدد مكون الوحدة الذي ترغب بتحريره.',
    'LBL_QUESTION_PACKAGE' => 'حدد الحزمة التي ترغب بتحريرها، أو أنشئ حزمة جديدة.',
    'LBL_QUESTION_EDITOR' => 'اختر أداة.',
    'LBL_QUESTION_DASHLET' => 'حدد تصميم التطبيق الفرعي الذي ترغب بتحريره.',
    'LBL_QUESTION_POPUP' => 'حدد تصميم النافذة المنبثقة الذي ترغب بتحريره.',
//CUSTOM FIELDS
    'LBL_NAME' => 'الاسم',
    'LBL_LABELS' => 'التسميات',
    'LBL_MASS_UPDATE' => 'تحديث جماعي',
    'LBL_DEFAULT_VALUE' => 'القيمة الافتراضية',
    'LBL_REQUIRED' => 'إلزامي',
    'LBL_DATA_TYPE' => 'النوع',
    'LBL_HCUSTOM' => 'مخصص',
    'LBL_HDEFAULT' => 'افتراضي',
    'LBL_LANGUAGE' => 'اللغة:',
    'LBL_CUSTOM_FIELDS' => '* حقل تم إنشاؤه في الاستوديو',

//SECTION
    'LBL_SECTION_EDLABELS' => 'تعديل التسميات',
    'LBL_SECTION_PACKAGES' => 'الحزم',
    'LBL_SECTION_PACKAGE' => 'الحزمة',
    'LBL_SECTION_MODULES' => 'نظام فرعي',
    'LBL_SECTION_DROPDOWNS' => 'القوائم المنسدلة',
    'LBL_SECTION_PROPERTIES' => 'الخصائص',
    'LBL_SECTION_DROPDOWNED' => 'تعديل القائمة المنسدلة',
    'LBL_SECTION_HELP' => 'مساعدة',
    'LBL_SECTION_MAIN' => 'الرئيسي',
    'LBL_SECTION_FIELDEDITOR' => 'تعديل الحقل',
    'LBL_SECTION_DEPLOY' => 'تنفيذ',
    'LBL_SECTION_MODULE' => 'نظام فرعي',
//WIZARDS

//LIST VIEW EDITOR
    'LBL_DEFAULT' => 'الإفتراضي',
    'LBL_HIDDEN' => 'مخفي',
    'LBL_AVAILABLE' => 'متاح',
    'LBL_LISTVIEW_DESCRIPTION' => 'هناك ثلاثة أعمدة معروضة أدناه. يحتوي العمود <b>الافتراضي</b> على الحقول التي يتم عرضها في طريقة عرض القائمة بشكل افتراضي. يحتوي العمود <b>الإضافي</b> على حقول يمكن أن يختار المستخدم استخدامها لإنشاء طريقة عرض مخصصة. العمود <b>المتاح</b> يعرض الحقول المتاحة لك كمدير للنظام لإضافتها إلى الأعمدة الافتراضية أو الإضافية لاستخدامها من قبل المستخدمين.',
    'LBL_LISTVIEW_EDIT' => 'محرر طريقة عرض القائمة',

//Manager Backups History
    'LBL_MB_PREVIEW' => 'معاينة',
    'LBL_MB_RESTORE' => 'استعادة',
    'LBL_MB_DELETE' => 'حذف',
    'LBL_MB_DEFAULT_LAYOUT' => 'التصميم الافتراضي',

//END WIZARDS

//BUTTONS
    'LBL_BTN_ADD' => 'إضافة',
    'LBL_BTN_SAVE' => 'حفظ',
    'LBL_BTN_SAVE_CHANGES' => 'حفظ التعديلات',
    'LBL_BTN_DONT_SAVE' => 'تخلص من التغييرات',
    'LBL_BTN_CANCEL' => 'إلغاء',
    'LBL_BTN_CLOSE' => 'إغلاق',
    'LBL_BTN_SAVEPUBLISH' => 'حفظ وتنفيذ',
    'LBL_BTN_CLONE' => 'استنساخ',
    'LBL_BTN_ADDROWS' => 'إضافة صفوف',
    'LBL_BTN_ADDFIELD' => 'أضف حقل',
    'LBL_BTN_ADDDROPDOWN' => 'إضافة قائمة منسدلة',
    'LBL_BTN_SORT_ASCENDING' => 'ترتيب تصاعدي',
    'LBL_BTN_SORT_DESCENDING' => 'ترتيب تنازلي',
    'LBL_BTN_EDLABELS' => 'تعديل التسميات',
    'LBL_BTN_UNDO' => 'تراجع',
    'LBL_BTN_REDO' => 'إعادة',
    'LBL_BTN_ADDCUSTOMFIELD' => 'إضافة حقل مخصص',
    'LBL_BTN_EXPORT' => 'تصدير التخصيصات',
    'LBL_BTN_DUPLICATE' => 'كرر',
    'LBL_BTN_PUBLISH' => 'نشر',
    'LBL_BTN_DEPLOY' => 'تنفيذ',
    'LBL_BTN_EXP' => 'تصدير',
    'LBL_BTN_DELETE' => 'احذف',
    'LBL_BTN_VIEW_LAYOUTS' => 'عرض التصاميم',
    'LBL_BTN_VIEW_FIELDS' => 'عرض حقول',
    'LBL_BTN_VIEW_RELATIONSHIPS' => 'عرض العلاقات',
    'LBL_BTN_ADD_RELATIONSHIP' => 'إضافة علاقة',
    'LBL_BTN_RENAME_MODULE' => 'تغيير اسم الوحدة',
//TABS


//ERRORS
    'ERROR_ALREADY_EXISTS' => 'خطأ: الحقل موجود من قبل',
    'ERROR_INVALID_KEY_VALUE' => "خطأ: قيمة المفتاح غير صالحة: [']",
    'ERROR_NO_HISTORY' => 'لم يتم العثور على ملفات سجل التاريخ',
    'ERROR_MINIMUM_FIELDS' => 'يجب أن يحتوي التصميم على حقل واحد على الأقل',
    'ERROR_GENERIC_TITLE' => 'لقد حدث خطأ',
    'ERROR_REQUIRED_FIELDS' => 'هل أنت متأكد من أنك تريد المتابعة؟ الحقول التالية الإلزامية مفقودة من التصميم:  ',


//PACKAGE AND MODULE BUILDER
    'LBL_PACKAGE_NAME' => 'اسم الحزمة:',
    'LBL_MODULE_NAME' => 'اسم الوحدة:',
    'LBL_AUTHOR' => 'المؤلف:',
    'LBL_DESCRIPTION' => 'الوصف:',
    'LBL_KEY' => 'المفتاح:',
    'LBL_ADD_README' => ' الملف الإرشادي (Readme)',
    'LBL_LAST_MODIFIED' => 'آخر تعديل:',
    'LBL_NEW_MODULE' => 'وحدة جديدة',
    'LBL_LABEL' => 'التسمية:',
    'LBL_LABEL_TITLE' => 'تسمية',
    'LBL_WIDTH' => 'العرض',
    'LBL_PACKAGE' => 'الحزمة:',
    'LBL_TYPE' => 'النوع:',
    'LBL_NAV_TAB' => 'علامة تبويب التنقل',
    'LBL_CREATE' => 'أنشئ',
    'LBL_LIST' => 'قائمة',
    'LBL_VIEW' => 'عرض',
    'LBL_HISTORY' => 'عرض تاريخي',
    'LBL_RESTORE_DEFAULT' => 'استعادة الافتراضي',
    'LBL_ACTIVITIES' => 'الأنشطة',
    'LBL_NEW' => 'جديد',
    'LBL_TYPE_BASIC' => 'بسيط',
    'LBL_TYPE_COMPANY' => 'شركة',
    'LBL_TYPE_PERSON' => 'شخص',
    'LBL_TYPE_ISSUE' => 'مشكلة',
    'LBL_TYPE_SALE' => 'بيع',
    'LBL_TYPE_FILE' => 'ملف',
    'LBL_RSUB' => 'هذا هو التطبيق الفرعي التي سيتم عرضه في الوحدة الخاصة بك',
    'LBL_MSUB' => 'هذا هو التطبيق الفرعي الذي توفره وحدتك للوحدة ذات الصلة للعرض',
    'LBL_MB_IMPORTABLE' => 'يتم استيراد',

// VISIBILITY EDITOR
    'LBL_PACKAGE_WAS_DELETED' => '[[package]] تم حذفه',

//EXPORT CUSTOMS
    'LBL_EC_TITLE' => 'تصدير التخصيصات',
    'LBL_EC_NAME' => 'اسم الحزمة:',
    'LBL_EC_AUTHOR' => 'المؤلف:',
    'LBL_EC_DESCRIPTION' => 'الوصف:',
    'LBL_EC_CHECKERROR' => 'يرجى تحديد وحدة.',
    'LBL_EC_CUSTOMFIELD' => 'حقول مخصصة',
    'LBL_EC_CUSTOMLAYOUT' => 'تصاميم مخصصة',
    'LBL_EC_NOCUSTOM' => 'لم يتم تخصيص أي وحدات.',
    'LBL_EC_EMPTYCUSTOM' => 'يحتوي على تخصيصات فارغة.',
    'LBL_EC_EXPORTBTN' => 'تصدير',
    'LBL_MODULE_DEPLOYED' => 'تم تنفيذ الوحدة.',
    'LBL_UNDEFINED' => 'غير معرف',
    'LBL_EC_VIEWS' => 'طرق عرض مخصصة',
    'LBL_EC_SUITEFEEDS' => 'موجزات مخصصة',
    'LBL_EC_DASHLETS' => 'تطبيقات فرعية مخصصة',
    'LBL_EC_CSS' => 'ملفات أنماط (css) مخصصة',
    'LBL_EC_TPLS' => 'ملفات قوالب (tpls) مخصصة',
    'LBL_EC_IMAGES' => 'ملفات صور مخصصة',
    'LBL_EC_JS' => 'ملفات شفرة جافا (js) مخصصة',
    'LBL_EC_QTIP' => 'ملفات تلميحات (qtip) مخصصة',

//AJAX STATUS
    'LBL_AJAX_FAILED_DATA' => 'فشل في استرداد البيانات',
    'LBL_AJAX_LOADING' => 'جاري التحميل...',
    'LBL_AJAX_DELETING' => 'جاري الحذف...',
    'LBL_AJAX_BUILDPROGRESS' => 'البناء قيد التنفيذ...',
    'LBL_AJAX_DEPLOYPROGRESS' => 'قيد التنفيذ...',

    'LBL_AJAX_RESPONSE_TITLE' => 'النتيجة',
    'LBL_AJAX_RESPONSE_MESSAGE' => 'إنجزت العملية بنجاح',
    'LBL_AJAX_LOADING_TITLE' => 'جاري التقدم...',
    'LBL_AJAX_LOADING_MESSAGE' => 'الرجاء الانتظار، جاري التحميل...',

//JS
    'LBL_JS_REMOVE_PACKAGE' => 'هل أنت متأكد من أنك تريد إزالة هذه الحزمة؟ سيؤدي هذا إلى حذف جميع الملفات المرتبطة بهذه الحزمة بشكل دائم.',
    'LBL_JS_REMOVE_MODULE' => 'هل أنت متأكد من أنك تريد حذف هذه الوحدة؟ سيؤدي هذا إلى حذف جميع الملفات المرتبطة بهذه الوحدة بشكل دائم.',
    'LBL_JS_DEPLOY_PACKAGE' => 'سيتم استبدال أي تخصيصات قمت بها في الاستوديو عند إعادة تنفيذ هذه الوحدة. هل أنت متأكد من أنك تريد المتابعة؟',

    'LBL_DEPLOY_IN_PROGRESS' => 'يتم تنفيذ الحزمة',
    'LBL_JS_VALIDATE_NAME' => 'الاسم - يجب أن يكون أبجديًا رقميًا، وأن يبدأ بحرف وأن لا يحتوي على أي مسافات.',
    'LBL_JS_VALIDATE_PACKAGE_NAME' => 'اسم الحزمة موجود من قبل',
    'LBL_JS_VALIDATE_KEY' => 'المفتاح - يجب أن يكون أبجديًا رقميًا، وأن يبدأ بحرف وأن لا يحتوي على مسافات.',
    'LBL_JS_VALIDATE_LABEL' => 'يرجى إدخال تسمية ليتم استخدامها كاسم معروض لهذه الوحدة',
    'LBL_JS_VALIDATE_TYPE' => 'الرجاء تحديد نوع الوحدة التي ترغب في بنائها من القائمة أعلاه',
    'LBL_JS_VALIDATE_REL_LABEL' => 'التسمية - الرجاء إضافة تسمية ليتم عرضها أعلى التطبيق فرعي',

//CONFIRM
    'LBL_CONFIRM_FIELD_DELETE' => 'سيؤدي حذف هذا الحقل المخصص إلى حذف الحقل المخصص وجميع البيانات المتعلقة بالحقل المخصص في قاعدة البيانات. لن يظهر الحقل بعد الآن في أي من تصاميم الوحدة.\\n\\nهل ترغب في المتابعة؟',

    'LBL_CONFIRM_RELATIONSHIP_DELETE' => 'هل أنت متأكد من أنك تريد حذف هذه العلاقة؟',
    'LBL_CONFIRM_DONT_SAVE' => 'تم إجراء تغييرات منذ آخر مرة قمت بالحفظ، هل ترغب في الحفظ؟',
    'LBL_CONFIRM_DONT_SAVE_TITLE' => 'حفظ التعديلات؟',
    'LBL_CONFIRM_LOWER_LENGTH' => 'قد يتم اجتزاء البيانات ولا يمكن التراجع عن هذا، هل أنت متأكد من رغبتك في المتابعة؟',

//POPUP HELP
    'LBL_POPHELP_FIELD_DATA_TYPE' => 'حدد نوع البيانات المناسبة بناء على نوع البيانات التي سيتم إدخالها في الحقل.',
    'LBL_POPHELP_IMPORTABLE' => '<b>نعم</b>: سيتم تضمين الحقل في عملية الاستيراد.<br><b>لا</b>: لن يتم تضمين الحقل في الاستيراد.<br><b>إلزامي</b>: يجب إدخال قيمة للحقل في أي عملية استيراد.',
    'LBL_POPHELP_IMAGE_WIDTH' => 'أدخل رقماً للعرض، بمقياس البكسل.<br> سيتم تعديل مقاس عرض الصورة التي تم رفعها إلى هذا العرض.',
    'LBL_POPHELP_IMAGE_HEIGHT' => 'أدخل رقما للارتفاع، بمقياس البكسل.<br> سيتم تعديل مقاس ارتفاع الصورة التي تم رفعها إلى هذا الارتفاع.',
    'LBL_POPHELP_DUPLICATE_MERGE' => '<b>مفعّل</b>: الحقل سيظهر في ميزة دمج التكرار، ولكن لن يكون متاحا للاستخدام ضمن شروط الفرز في ميزة العثور على التكرار.<br><b>معطل</b>: الحقل لن يظهر في ميزة دمج التكرار، ولن يكون متاحا للاستخدام ضمن شروط الفرز في ميزة العثور على التكرار.<br><b>فرز</b>: سيظهر الحقل في ميزة دمج التكرار، وسيكون متاحا للاستخدام ضمن شروط الفرز في ميزة العثور على التكرار.<br><b>الفرز الافتراضي المحدد</b>: سيظهر الحقل في ميزة دمج التكرار، وسيتم استخدامه بشكل افتراضي ضمن شروط الفرز في ميزة العثور على التكرار.<br><b>عامل فرز فقط</b>: الحقل لن يظهر في ميزة دمج التكرار، ولكن ستكون متاحا للاستخدام ضمن شروط الفرز في ميزة العثور على التكرار.',

//Revert Module labels
    'LBL_RESET' => 'إعادة ضبط',
    'LBL_RESET_MODULE' => 'إعادة ضبط الوحدة',
    'LBL_REMOVE_CUSTOM' => 'إزالة التخصيصات',
    'LBL_CLEAR_RELATIONSHIPS' => 'مسح العلاقات',
    'LBL_RESET_LABELS' => 'إعادة ضبط التسميات',
    'LBL_RESET_LAYOUTS' => 'إعداة ضبط التصاميم',
    'LBL_REMOVE_FIELDS' => 'إزالة الحقول المخصصة',
    'LBL_CLEAR_EXTENSIONS' => 'مسح الإضافات',
    'LBL_HISTORY_TIMESTAMP' => 'ختم زمني (TimeStamp)',
    'LBL_HISTORY_TITLE' => ' التاريخ',

    'fieldTypes' => array(
        'varchar' => 'حقل نصي',
        'int' => 'عدد صحيح',
        'float' => 'عدد عشري (Float)',
        'bool' => 'خانة الاختيار',
        'enum' => 'قائمة منسدلة',
        'dynamicenum' => 'قائمة منسدلة متغيرة',
        'multienum' => 'متعدد الإختيارات (MultiSelect)',
        'date' => 'التاريخ',
        'phone' => 'هاتف',
        'currency' => 'العملة',
        'html' => 'HTML',
        'radioenum' => 'راديو',
        'relate' => 'مرتبط بـ',
        'address' => 'عنوان',
        'text' => 'مساحة نصية (TextArea)',
        'url' => 'الرابط',
        'iframe' => 'صفحة مدمجة (IFrame)',
        'datetimecombo' => 'تاريخ ووقت (Datetime)',
        'decimal' => 'عشري',
        'image' => 'صورة',
        'wysiwyg' => 'ما تراه هو ما تحصل عليه (WYSIWYG)',
    ),
    'labelTypes' => array(
        "frequently_used" => "التسميات المستخدمة بشكل متكرر",
        "all" => "جميع التسميات",
    ),

    'parent' => 'علاقة مرنة (Flex Relate)',

    'LBL_CONFIRM_SAVE_DROPDOWN' => "أنت تختار هذا العنصر لإزالته من القائمة المنسدلة. لن تقوم أي حقول قوائم منسدلة بعرض القيمة إذا كانت تستخدم هذه القائمة وكان هذا العنصر هو القيمة المحددة، ولن تكون القيمة بعد الآن قابلة للاختيار في حقول القوائم المنسدلة. هل أنت متأكد من أنك تريد المتابعة؟",

    'LBL_ALL_MODULES' => 'كل الوحدات',
    'LBL_RELATED_FIELD_ID_NAME_LABEL' => '{0} (معرف ذو صلة {1})',
);
